<?php

namespace Typo\Module;

use Typo;
use Typo\Module;

/**
 * Пунктуация.
 *
 * @link http://wikipedia.org/wiki/Punctuation
 */
class Punct extends Module
{
    /**
     * Настройки по умолчанию.
     *
     * @var array
     */
    protected $default_options = array(
        /**
         * Исправление пробелов возле пунктуации.
         *
         * @var bool
         */
        'spaces' => true,

        /**
         * Автоматическая расстановка пунктуации.
         *
         * @var bool
         */
        'auto' => false,
    );

    /**
     * Приоритет выполнения стадий.
     *
     * @var array
     */
    static public $order = array(
        'A' => 0,
        'B' => 10,
        'C' => 0,
        'D' => 0,
        'E' => 0,
        'F' => 0,
    );


    // --- Открытые методы класса ---

    /**
     * Стадия B.
     *
     * Применяет правила для расстановки пунктуации в тексте.
     *
     * @return void
     */
    protected function stageB()
    {
        $s =& Typo::$chars['chr'];

        $rules = array(
            // Исправление пробелов возле пунктуации
            'spaces' => array(
                #B1 Убираем лишние пробелы
                '~(?<={p})({t}*)\h+(?=(({t}|\h)*){p})~' => '$1',
                '~(?<=^|\n|\)|{a}|\]\]\])({t}*)\h+(?=(({t}|\h)*){p})~u' => '$1',

                #B2 Добавляем недостающие пробелы
                '~(?<=^|\n|\)|{a}|\]\]\])((?:{t}*{p}{t}*)+)\h*(?={t}*(\(|{a}|{b}))~iu' => '$1 ',
                '~([,\.]{t}*)-~' => '$1 -',
            ),

            #B3 Замена  двух знаков "..", "?.", "!." на три "...", "?..", "!.."
            '~(?<=^|\n|\)|{a}|\]\]\])({t}*[!?\.]{t}*)\.(?!{t}*{p})~u' => '$1..',

            #B4 Замена двух одинаковх знаков на один
            '~(?<=^|\n|\)|{a}|\]\]\])({t}*)({p})({t}*)\\2(?!{t}*{p})~u' => '$1$2$3$4',

            #B5 Замена "!?" на "?!"
            '~(?<=^|\n|\)|{a}|\]\]\])({t}*)\!({t}*)\?(?!{t}*{p})~u' => '$1?$2!',

            #B6 Оставляем 3 знака ("???", "?!!", "?.." и т. п.) вместо 4 или 5
            '~(?<=^|\n|\)|{a}|\]\]\])({t}*(?:\!{t}*|\?{t}*|\.{t}*){3})(?:\!{t}*|\?{t}*|\.{t}*){1,2}(?!{p})~u' => '$1',

            #B7 Заменяем три точки на знак многоточия
            '~(?<=^|\n|\)|{a}|\]\]\])({t}*)\.{3}(?!{t}*{p})~u' => '$1' . $s['hellip'],

            #B8 Убираем лишние запятые, двоеточия и точки с запятой
            '~([,:;]){2,}~' => '$1',

            // Автоматическая расстановка пунктуации
            'auto' => array(
                #B9 Расстановка запятых перед союзами "а" и "но"
                '~({a}|{b})\h(но|а)(?=\h)~u' => '$1, $2',

                #B10 Добавление забытой точки в конце текста
                '~({a}{t}*)$~u' => '$1.',
            ),
        );

        $this->applyRules($rules);
    }
}